// 伪数据 避免网络请求，使用js模拟json数据
floorData = [{
  num: '1',
  text: '米面粮油',
  tabs: ['综合', '干果', '米面粮油'],
  items: [
    [{
      name: '剑南春 水晶剑 52度 整箱装白酒 500ml*6瓶 口感浓香型',
      price: 479
    }, {
      name: '金纺 衣物护理剂 怡神薰衣草 2.5L+2.5L(柔顺剂) (与洗衣液搭配使用)',
      price: 335
    }, {
      name: '百草味 坚果零食干果 每日坚果 奶油味夏威夷果200g/袋(内含开果器)',
      price: 159
    }, {
      name: '优选100 有机速冻鲜食黄糯玉米 6支 240g/支 年货礼盒',
      price: 65
    }, {
      name: '三只松鼠每日坚果年货节礼盒零食坚果年货大礼包孕妇零食小吃榛子巴旦木仁开心果混合果仁30袋装 750g/盒',
      price: 69
    }, {
      name: '农夫山泉 17.5*橙 3kg装 铂金果年货礼盒 新鲜水果',
      price: 49
    }, {
      name: '八马茶业 茶叶 云南普洱茶熟茶茶饼黑茶自饮简易装357g',
      price: 289
    }, {
      name: '胡姬花 食用油 压榨 特香型花生油 6.18L(定制装)',
      price: 369
    }, {
      name: '澳洲进口 德运(Devondale) 脱脂成人奶粉 原装进口奶粉 1kg/袋',
      price: 399
    }, {
      name: '福临门 泰玉香 一品茉莉香米 进口原粮 大米 中粮出品 5kg (包装更新，新老包装随机发放)',
      price: 689
    }, {
      name: '【送4只】阳澄福记 大闸蟹全母蟹 2.3-2.6两/只 6只装生鲜鲜活现货 湖蟹螃蟹',
      price: 269
    }, {
      name: '户外旅行双肩背包OS0099',
      price: 99
    }],
    [{
      name: '匡威男棒球开衫外套2015',
      price: 479
    }, {
      name: 'adidas 阿迪达斯 训练 男子',
      price: 335
    }, {
      name: '必迈BMAI一体织跑步短袖T恤',
      price: 159
    }, {
      name: 'NBA袜子半毛圈运动高邦棉袜',
      price: 65
    }, {
      name: '特步官方运动帽男女帽子2016',
      price: 69
    }, {
      name: 'KELME足球训练防寒防风手套',
      price: 4999
    }, {
      name: '战地吉普三合一冲锋衣',
      price: 289
    }, {
      name: '探路者户外男士徒步鞋',
      price: 369
    }, {
      name: '羽绒服2015秋冬新款轻薄男士',
      price: 399
    }, {
      name: '溯溪鞋涉水鞋户外鞋',
      price: 689
    }, {
      name: '旅行背包多功能双肩背包',
      price: 269
    }, {
      name: '户外旅行双肩背包OS0099',
      price: 99
    }],
    [{
      name: '匡威男棒球开衫外套2015',
      price: 479
    }, {
      name: 'adidas 阿迪达斯 训练 男子',
      price: 335
    }]
  ]
}, {
  num: '2',
  text: '个护美妆',
  tabs: ['热门', '国际大牌', '国际名品'],
  items: [
    [{
      name: '【大容量300ml限量抢】滋润修护 芦荟胶（补水保湿晒后修复 祛痘印 收缩毛孔）',
      price: 169
    }, {
      name: '美宝莲 MAYBLLIN 超然无暇二合一提亮轻垫霜 03自然色（1+1气垫 巨遮瑕轻薄裸妆滋润保湿隔离）+替换装',
      price: 198
    }, {
      name: '阿玛尼 ARMANI 持色凝彩哑光染唇液506 3.9ml（小胖丁 口红 轻薄 持久）',
      price: 79.9
    }, {
      name: '美宝莲 MAYBELLINE 定制柔雾粉底液125 30ml(fit me 粉底液 遮瑕轻薄哑光控油持久隐形毛孔）',
      price: 228
    }, {
      name: '欧莱雅（LOREAL)男士补水保湿护肤套装（洁面膏100ml+水凝露120ml+强润霜50ml+洁面+滋润乳）',
      price: 119
    }, {
      name: '泰国进口 妆蕾RAY 金属蚕丝面膜10片/盒 提亮修复 抗皱紧致 轻透祛痘 品牌直供',
      price: 39
    }, {
      name: '美宝莲 MAYBELLINE 超然无暇二合一提亮轻垫霜 01亮肤色 11.5g（1+1气垫 巨遮瑕轻薄裸妆滋润保湿隔离）',
      price: 299
    }, {
      name: '总利益集团 小美盒补水保湿护肤品套装礼盒 兰蔻 hr ysl 美丽奇遇盒 爽肤水+精华+口红+香水',
      price: 257
    }, {
      name: '美迪惠尔（Mediheal)Line Friends 恋朋 水润保湿面膜10片（韩国进口）补水水库面膜 元克莱斯',
      price: 199
    }, {
      name: '珀莱雅（PROYA)靓白肌密美白保湿五件套（洁面120ml+水150ml+乳液120ml+面霜50g+面膜*2+小样*2）',
      price: 36
    }, {
      name: '欧莱雅（LOREAL）清润葡萄籽补水护肤化妆品套装礼盒（膜力水130ml+乳液110ml+乳液50ml+膜力水65ml）',
      price: 139
    }, {
      name: 'MG美肌面膜 清莹无忧补水祛痘补水保湿面膜套装20片（控油清洁 男女士面膜贴）',
      price: 99
    }],
    [{
      name: '韩束红石榴鲜活水盈七件套装',
      price: 169
    }, {
      name: '温碧泉八杯水亲亲水润五件套装',
      price: 198
    }, {
      name: '御泥坊红酒透亮矿物蚕丝面膜贴',
      price: 79.9
    }, {
      name: '吉列手动剃须刀锋隐致护',
      price: 228
    }, {
      name: 'Mediheal水润保湿面膜',
      price: 119
    }, {
      name: '纳益其尔芦荟舒缓保湿凝胶',
      price: 39
    }, {
      name: '宝拉珍选基础护肤旅行四件套',
      price: 299
    }, {
      name: '温碧泉透芯润五件套装',
      price: 257
    }, {
      name: '玉兰油多效修护三部曲套装',
      price: 199
    }, {
      name: 'LOREAL火山岩控油清痘洁面膏',
      price: 36
    }, {
      name: '百雀羚水嫩倍现盈透精华水',
      price: 139
    }, {
      name: '珀莱雅新柔皙莹润三件套',
      price: 99
    }],
    [{
      name: '韩束红石榴鲜活水盈七件套装',
      price: 169
    }, {
      name: '温碧泉八杯水亲亲水润五件套装',
      price: 198
    }, {
      name: '御泥坊红酒透亮矿物蚕丝面膜贴',
      price: 79.9
    }, {
      name: '吉列手动剃须刀锋隐致护',
      price: 228
    }]
  ]
}]